<?php  

include("request.php");   
   
$strGender = $sex;
	$strGenderText = "";
	if($strGender == "1")
	{
		$strGenderText = "ชาย";
	}
	else
	{
		$strGenderText = "หญิง";
	}
$bmi= number_format($weight/(($height/100)*($height/100)), 2, '.', '');	

$BMI = $bmi;
	$BMI_Text = "";
	if($BMI == "0")
	{
		$BMI_Text = "ไม่ได้ตรวจ";
	}
	if($BMI > 0)
	{
		$BMI_Text = "น้ำหนักน้อยกว่ามาตรฐาน";
	}
	if($BMI > 18.5)
	{
		$BMI_Text = "	น้ำหนักปกติ";
	}
	if($BMI > 22.9)
	{
		$BMI_Text = "อ้วนระดับ 1 ถือว่ายังมีความเสี่ยงมากกว่าคนปกติ";
	}
    if($BMI > 24.9)
	{
		$BMI_Text = "อ้วนระดับ 2 เสี่ยงต่อการเกิดโรคที่มากับความอ้วนได้เช่นกัน ทั้งโรคเบาหวาน และความดันโลหิตสูง";
	}
	if($BMI > 29.9)
	{
		$BMI_Text = "อ้วนระดับ 3 เสี่ยงต่อการเกิดโรคที่มากับความอ้วนได้เช่นกัน ทั้งโรคเบาหวาน และความดันโลหิตสูง";
	}
$BP = $systolic;
	$BPText = "";
	if($BP == "0")
	{
		$BPText = "ไม่ได้ตรวจ";
	}
	if($BP > 0)
	{
		$BPText = "ความดันโลหิตต่ำ";
	}
	if($BP > 90)
	{
		$BPText = "ความดันโลหิตปกติ";
	}
	if($BP > 130)
	{
		$BPText = "ความดันโลหิตสูงกว่าปกติ สามารถนำไปสู่โรคแทรกซ้อนต่างๆ เช่น โรคหลอดเลือดสมอง โรคหัวใจขาดเลือด";
	}
	
$rbc1 = $Hct;
	$rbc1Text = "";
	if($rbc1 == "0")
	{
		$rbc1Text = "ไม่ได้ตรวจ";
	}
	if($rbc1 > 0)
	{
		$rbc1Text = "มีภาวะโลหิตจาง";
	}
	if($rbc1 > 36)
	{
		$rbc1Text = "ความเข้มข้นของเลือดปกติ";
	}
	if($rbc1 > 50.8)
	{
		$rbc1Text = "ความเข้มข้นของเลือดสูงกว่าปกติ";
	}

$wbc1 = $WBC;
	$wbc1Text = "";
	if($wbc1 == "0")
	{
		$wbc1Text = "ไม่ได้ตรวจ";
	}
	if($wbc1 > 0)
	{
		$wbc1Text = "เม็ดเลือดขาวต่ำ ทำให้มีโอกาสติดเชื้อได้ง่าย";
	}
	if($wbc1 > 4600)
	{
		$wbc1Text = "เม็ดเลือดขาวปกติ";
	}
	if($wbc1 > 10600)
	{
		$wbc1Text = "เม็ดเลือดขาวสูงกว่าปกติ เป็นภาวะที่ร่างกายตอบสนองต่อภาวะอักเสบหรือติดเชื้อในร่างกาย";
	}
		
$Plt1 = $Plt;
	$Plt1Text = "";
	if($Plt1 == "0")
	{
		$Plt1Text = "ไม่ได้ตรวจ";
	}
	if($Plt1 > "0")
	{
		$Plt1Text = "เกล็ดเลือดต่ำ สามารถเกิดได้จาก ยา สารเคมี รังสี ภูมิต้านทานตนเองทำลายเกล็ดเลือด ไวรัส และม้ามที่โตผิดปกติ";
	}
	if($Plt1 > "100000")
	{
		$Plt1Text = "เกล็ดเลือดปกติ";
	}
	if($Plt1 > "440,000")
	{
		$Plt1Text = "ภาวะเกล็ดเลือดสูง พบได้ในภาวะที่มีปัจจัยการกระตุ้นการสร้างเกล็ดเลือดให้มากขึ้น ได้แก่ การอักเสบหรือติดเชื้อเรื้อรัง การมีมะเร็งในร่างกาย";
	}
	
$Ualb = $Ualb;
	$UalbText = "";
	if($Ualb == "Positive")
	{
		$UalbText = "มีโปรตีนในปัสสาวะ";
	}
	if($Ualb == "Negative")
	{
		$UalbText = "ไม่มีโปรตีนในปัสสาวะ";
	}
			
$Usugar = $Usugar;
	$UsugarText = "";
	if($Usugar == "Positive")
	{
		$UsugarText = "มีน้ำตาลในปัสสาวะ";
	}
	if($Usugar == "Negative")
	{
		$UsugarText = "ไม่มีน้ำตาลในปัสสาวะ";
	}	

$Uwbc = $Uwbc;
	$UwbcText = "";
	
	if($Uwbc > "0")
	{
		$UwbcText = "มีเม็ดเลือดขาวในปัสสาวะ";
	}
	else
	{
		$UwbcText = "";
	}
	
$Urbc = $Urbc;
	$UrbcText = "";
	
	if($Urbc > "0")
	{
		$UrbcText = "มีเม็ดเลือดแดงในปัสสาวะ";
	}
	else
	{
		$UrbcText = "";
	}		
	
			
?>	
	
	