<?php  

include("request.php");   
   
$strGender = $sex;
	$strGenderText = "";
	if($strGender == "1")
	{
		$strGenderText = "ชาย";
	}
	else
	{
		$strGenderText = "หญิง";
	}

$BMI_1 = $bmi1;
	$BMI_1Text = "";
	if($BMI_1 == "0")
	{
		$BMI_1Text = "ไม่ได้ตรวจ";
	}
	if($BMI_1 > 0)
	{
		$BMI_1Text = "น้ำหนักน้อยกว่ามาตรฐาน";
	}
	if($BMI_1 > 18.5)
	{
		$BMI_1Text = "	น้ำหนักปกติ";
	}
	if($BMI_1 > 22.9)
	{
		$BMI_1Text = "อ้วนระดับ 1 ถือว่ายังมีความเสี่ยงมากกว่าคนปกติ";
	}
    if($BMI_1 > 24.9)
	{
		$BMI_1Text = "อ้วนระดับ 2 เสี่ยงต่อการเกิดโรคที่มากับความอ้วนได้เช่นกัน ทั้งโรคเบาหวาน และความดันโลหิตสูง";
	}
	if($BMI_1 > 29.9)
	{
		$BMI_1Text = "อ้วนระดับ 3 เสี่ยงต่อการเกิดโรคที่มากับความอ้วนได้เช่นกัน ทั้งโรคเบาหวาน และความดันโลหิตสูง";
	}
$BP = $result["systolic"];
	$BPText = "";
	if($BP == "0")
	{
		$BPText = "ไม่ได้ตรวจ";
	}
	if($BP > 0)
	{
		$BPText = "ความดันโลหิตต่ำ";
	}
	if($BP > 90)
	{
		$BPText = "ความดันโลหิตปกติ";
	}
	if($BP > 130)
	{
		$BPText = "ความดันโลหิตสูงกว่าปกติ สามารถนำไปสู่โรคแทรกซ้อนต่าง ๆ เช่น โรคหลอดเลือดในสมองตีบ/แตก โรคหัวใจขาดเลือดเฉียบพลัน เป็นต้น";
	}

$rbc1 = $result2["Hct"];
	$rbc1Text = "";
	if($rbc1 == "0")
	{
		$rbc1Text = "ไม่ได้ตรวจ";
	}
	if($rbc1 > 0)
	{
		$rbc1Text = "มีภาวะโลหิตจาง";
	}
	if($rbc1 > 36)
	{
		$rbc1Text = "ความเข้มข้นของเลือดปกติ";
	}
	if($rbc1 > 50.8)
	{
		$rbc1Text = "ความเข้มข้นของเลือดสูงกว่าปกติ";
	}

$wbc1 = $result2["WBC"];
	$wbc1Text = "";
	if($wbc1 == "0")
	{
		$wbc1Text = "ไม่ได้ตรวจ";
	}
	if($wbc1 > 0)
	{
		$wbc1Text = "เม็ดเลือดขาวต่ำ ทำให้มีโอกาสติดเชื้อได้ง่าย";
	}
	if($wbc1 > 4600)
	{
		$wbc1Text = "เม็ดเลือดขาวปกติ";
	}
	if($wbc1 > 10600)
	{
		$wbc1Text = "เม็ดเลือดขาวสูงกว่าปกติ เป็นภาวะที่ร่างกายตอบสนองต่อภาวะอักเสบหรือติดเชื้อในร่างกาย";
	}
		
$Plt1 = $result2["Plt"];
	$Plt1Text = "";
	if($Plt1 == "0")
	{
		$Plt1Text = "ไม่ได้ตรวจ";
	}
	if($Plt1 > "0")
	{
		$Plt1Text = "เกล็ดเลือดต่ำ สามารถเกิดได้จาก ยา สารเคมี รังสี ภูมิต้านทานตนเองทำลายเกล็ดเลือด ไวรัส และม้ามที่โตผิดปกติ";
	}
	if($Plt1 > "100000")
	{
		$Plt1Text = "เกล็ดเลือดปกติ";
	}
	if($Plt1 > "440,000")
	{
		$Plt1Text = "ภาวะเกล็ดเลือดสูง พบได้ในภาวะที่มีปัจจัยการกระตุ้นการสร้างเกล็ดเลือดให้มากขึ้น ได้แก่ การอักเสบหรือติดเชื้อเรื้อรัง การมีมะเร็งในร่างกาย";
	}
	
$Ualb1 = $result3["Alb"];
	$Ualb1Text = "";
	if($Ualb1 == "Positive")
	{
		$Ualb1Text = "มีโปรตีนในปัสสาวะ";
	}
	if($Ualb1 == "Negative")
	{
		$Ualb1Text = "ไม่มีโปรตีนในปัสสาวะ";
	}
			
$Usugar1 = $result3["Sugar"];
	$Usugar1Text = "";
	if($Usugar1 == "Positive")
	{
		$Usugar1Text = "มีน้ำตาลในปัสสาวะ";
	}
	if($Usugar1 == "Negative")
	{
		$Usugar1Text = "ไม่มีน้ำตาลในปัสสาวะ";
	}	

$Uwbc1 = $result3["Uwbc"];
	$Uwbc1Text = "";
	
	if($Uwbc1 > "0")
	{
		$Uwbc1Text = "มีเม็ดเลือดขาวในปัสสาวะ";
	}
	else
	{
		$Uwbc1Text = "";
	}
	
$Urbc1 = $result3["Urbc"];
	$Urbc1Text = "";
	
	if($Urbc1 > "0")
	{
		$Urbc1Text = "มีเม็ดเลือดแดงในปัสสาวะ";
	}
	else
	{
		$Urbc1Text = "";
	}
	
$stool_1 = $result5["sRBC"];
	$stool_2Text = "";
	
	if($stool_1 = "Not found")
	{
		$stool_1Text = "ไม่พบเม็ดเลือดแดงในอุจจาระ";
	}
	else 
	{
		$stool_1Text = "";
	}
	
$stool_2 = $result5["sWBC"];
	$stool_2Text = "";
	
	if($stool_2 = "Not found")
	{
		$stool_2Text = "ไม่พบเม็ดเลือดขาวในอุจจาระ";
	}
	else
	{
		$stool_2Text = "";
	}	
	
$FBS1 = $result4["FBS"];
	$CrText = "";
	if($FBS1 == "0")
	{
		$FBS1Text = "ไม่ได้ตรวจ";
	}
	if($FBS1 > "0")
	{
		$FBS1Text =  "ระดับน้ำตาลในเลือดต่ำ";
	}
	if($FBS1 > "50")
	{
		$FBS1Text = "ปกติ  - ไม่เป็นโรคเบาหวาน";
	}
	if($FBS1 > "110")
	{
		$FBS1Text = "สูงกว่าปกติ  - บ่งบอกถึงการเป็นกลุ่มเสี่ยงโรคเบาหวาน";
	}
	if($FBS1 > "125")
	{
		$FBS1Text = "สูงกว่าปกติ  - บ่งบอกถึงการเป็นโรคเบาหวาน";
	}
	if($FBS1 >= "300")
	{
		$FBS1Text = "สูงกว่าปกติ  - บ่งบอกถึงการเป็นโรคเบาหวานรุนแรง";
	}	

$renal = $result4["eGFR"];
	$renalText = "";
	
	if($renal > "0")
	{
		$renalText = "ไตเสื่อมระยะที่5  ค่า GFR < 15 มล./นาที เป็นระยะสุดท้ายที่ถือว่าไตสูญเสียการทำงานไปแล้ว";
	}
	if($renal >= "15")
	{
		$renalText = "ไตเสื่อมระยะที่4  ค่า GFR = 15 – 29 มล./นาที เป็นระยะที่ไตทำงานผิดปกติอย่างมาก ";
	}
	if($renal >= "30")
	{
		$renalText = "ไตเสื่อมระยะที่3  ค่า GFR = 30 – 59 มล./นาที เป็นระยะที่ไตทำงานผิดปกติปานกลาง";
	}
	if($renal >= "60")
	{
		$renalText = "ไตเสื่อมระยะที2  ค่า GFR = 60 – 89 มล./นาที เป็นระยะที่ไตเริ่มทำงานผิดปกติเล็กน้อย";
	}
	if($renal >= "90")
	{
		$renalText = "ไตยังทำงานปกติ";
	}
	
$uric1 = $result4["Uric"];
	$uric1Text = "";
	if($uric1 == "0")
	{
		$uric1Text = "ไม่ได้ตรวจ";
	}
	if($uric1 > "0")
	{
		$uric1Text = "กรดยูริกในเลือดปกติ  ยังไม่เสี่ยงต่อการเป็นโรคเก๊าท์";
	}
	if($uric1 > "7.2")
	{
		$uric1Text = "กรดยูริกในเลือดสูง  เสี่ยงต่อการเป็นโรคเก๊าท์ ";
	}
		
$CEA = $result4["CEA"];
	$CEAText = "";
	if($CEA == "0")
	{
		$CEAText = "ไม่ได้ตรวจ";
	}
	if($CEA > "0")
	{
		$CEAText = "ปกติ";
	}
	if($CEA > "5")
	{
		$CEAText = "สูงกว่าปกติ  CEA มักขึ้นสูงผิดปกติในผู้ป่วยมะเร็งของระบบทางเดินอาหาร, มะเร็งตับอ่อน, มะเร็งเต้านม, มะเร็งปอด, มะเร็งรังไข่ ฯลฯ  โดยเฉพาะ มะเร็งลำไส้ใหญ่ จะพบ CEA สูงได้มากและบ่อยกว่ามะเร็งชนิดอื่นๆ ";
	}
	
$AFP1 = $result4["AFP"];
	$AFP1Text = "";
	if($AFP1 == "0")
	{
		$AFP1Text = "ไม่ได้ตรวจ";
	}
	if($AFP1 > "0")
	{
		$AFP1Text = "ปกติ";
	}
	if($AFP1 > "13.4")
	{
		$AFP1Text = "สูงกว่าปกติ  AFP สูงขึ้นเพียงเล็กน้อย แต่จะสูงมากขึ้นเป็นลำดับในมะเร็งระยะท้าย  นอกจากนั้นยังอาจพบ AFP สูงขึ้นได้ในผู้ป่วยโรคตับอื่นๆ ที่ไม่ใช่มะเร็ง แต่ระดับมักไม่สูงมากนัก ";
	}
		
$CA1531 = $result4["CA153"];
	$CA1531Text = "";
	if($CA1531 == "0")
	{
		$CA1531Text = "ไม่ได้ตรวจ";
	}
	if($CA1531 > "0")
	{
		$CA1531Text = "ปกติ";
	}
	if($CA1531 > "22")
	{
		$CA1531Text = "สูงกว่าปกติ CA 15-3 มีค่าสูงขึ้นได้ในมะเร็งหลายชนิด เช่น มะเร็งเต้านม, มะเร็งของระบบทางเดินอาหาร, มะเร็งตับ, มะเร็งตับอ่อน, มะเร็งปอด, มะเร็งรังไข่ เป็นต้น ";
	}
$PSA1 = $result4["PSA"];
	$PSA1Text = "";
	if($PSA1 == "0")
	{
		$PSA1Text = "ไม่ได้ตรวจ";
	}
	if($PSA1 > "0")
	{
		$PSA1Text = "ปกติ";
	}
	if($PSA1 > "4")
	{
		$PSA1Text = "สูงกว่าปกติ  PSA สูงกว่าปกติได้ทั้งใน มะเร็งต่อมลูกหมาก  และภาวะต่อมลูกหมากโตที่ไม่ใช่มะเร็ง (benign prostatic hyperplasia, BPH) ";
	}		


$HBsAg1 = $result4["HBsAg"];
	$HBsAg1Text = "";
	if($HBsAg1 == "Positive")
	{
		$HBsAg1Text = "พบเชื้อ  - ไวรัสตับอักเสบชนิด บี";
	}
	if($HBsAg1 == "Negative")
	{
		$HBsAg1Text = "ไม่พบเชื้อ  - ไวรัสตับอักเสบชนิด บี";
	}
	else
	{
		$HBsAg1Text = "ไม่ได้ตรวจ";
	}
		
$HBsAb1 = $result4["HBsAb"];
	$HBsAb1Text = "";
	if($HBsAg1 == "Positive")
	{
		$HBsAb1Text = "มีภูมิคุ้มกัน  - ไวรัสตับอักเสบชนิด บี";
	}
	if($HBsAg1 == "Negative")
	{
		$HBsAb1Text = "ไม่มีภูมิคุ้มกัน  - ไวรัสตับอักเสบชนิด บี";
	}
	else
	{
	   $HCVAb1Text = "ไม่ได้ตรวจ";
	}
	
$HCVAb1 = $result4["HCVAb"];
	$HCVAb1Text = "";
	if($HCVAb1 == "Positive")
	{
	   $HCVAb1Text = "มีภูมิคุ้มกัน  - ไวรัสตับอักเสบชนิด ซี";
	}
	if($HCVAb1 == "Negative")
	{
	   $HCVAb1Text = "ไม่มีภูมิคุ้มกัน  - ไวรัสตับอักเสบชนิด ซี";
	}
	else
	{
	   $HCVAb1Text = "ไม่ได้ตรวจ";
	}			
?>	
	
	